Repository: Shaxzodbek16/TinglaBot
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: kr, ru, uz

source: start_welcome
kr: 👋 Хуш келибсиз! Илтимос, тилни танланг:
ru: 👋 Добро пожаловать! Пожалуйста, выберите язык:
uz: 👋 Xush kelibsiz! Iltimos, tilni tanlang:

source: start
kr: 👋 Яна бир бор хуш келибсиз! Давом этиш учун менюдан фойдаланинг.
ru: 👋 С возвращением! Используйте меню ниже для начала работы.
uz: 👋 Yana bir bor xush kelibsiz! Davom etish uchun menyudan foydalaning.

source: help_message
kr: ℹ️ <b>Ёрдам</b> Ушбу бот турли платформалардан видеоларни юклаб олиш имконини беради. Керакли платформани танлаш учун менюдан фойдаланинг.
ru: ℹ️ <b>Помощь</b> Этот бот позволяет загружать видео с различных платформ. Используйте главное меню для выбора нужной платформы.
uz: ℹ️ <b>Yordam</b> Bu bot turli platformalardan videolarni yuklab olish imkonini beradi. Kerakli platformani tanlash uchun menyudan foydalaning.

source: ig_detected
kr: 📎 Instagram ҳаволаси аниқланди! Қайта ишланмоқда...
ru: 📎 Ссылка на Instagram обнаружена! Обработка...
uz: 📎 Instagram havolasi aniqlandi! Qayta ishlanmoqda...

source: ig_video_ready
kr: 📽 Instagram видеонгиз тайёр!
ru: 📽 Вот ваше видео из Instagram!
uz: 📽 Instagram videongiz tayyor!

source: ig_unknown_action
kr: ❌ Номаълум амал.
ru: ❌ Неизвестное действие.
uz: ❌ Nomaʼlum amal.

source: ig_extracting
kr: 🔍 Мусиқа ажратилаётган ва аниқланаётган...
ru: 🔍 Извлечение и распознавание музыки...
uz: 🔍 Musiqa ajratilmoqda va aniqlanmoqda...

source: ig_session_expired
kr: ❌ Сессия тугаган. Илтимос, ҳаволани қайта юборинг.
ru: ❌ Сессия истекла. Пожалуйста, отправьте ссылку снова.
uz: ❌ Sessiya tugagan. Iltimos, havolani qayta yuboring.

source: ig_extract_failed
kr: ❌ Аудио ажратиб бўлмади.
ru: ❌ Не удалось извлечь аудио.
uz: ❌ Audio ajratib bo‘lmadi.

source: ig_music_not_recognized
kr: 😕 Видеодан мусиқа аниқланмади.
ru: 😕 Музыка в видео не распознана.
uz: 😕 Videodan musiqa aniqlanmadi.

source: ig_music_found
kr: 🎶 <b>{title}</b> 👤 {artist}
ru: 🎶 <b>{title}</b> 👤 {artist}
uz: 🎶 <b>{title}</b> 👤 {artist}

source: ig_recognition_error
kr: ❌ Аниқлаш жараёнида хатолик юз берди.
ru: ❌ Что-то пошло не так при распознавании.
uz: ❌ Aniqlash jarayonida xatolik yuz berdi.

source: lang_choose
kr: 🌐 Илтимос, тилни танланг:
ru: 🌐 Пожалуйста, выберите язык:
uz: 🌐 Iltimos, tilni tanlang:

source: developer_info
kr: 🤖 Ушбу бот <a href='https://t.me/tmshaxzodbek'>@tmshaxzodbek</a> томонидан яратилган. 🌐 Сайт: <a href='https://shaxzodbek.com'>Shaxzodbek</a> 💼 LinkedIn: <a href='https://linkedin.com/in/shaxzodbek-muxtorov-59144a294'>shaxzodbek</a> 📧 Email: <a href='mailto:muxtorovshaxzodbek16@gmail.com'>muxtorovshaxzodbek16@gmail.com</a> 📱 GitHub: <a href='https://github.com/Shaxzodbek16'>github.com/Shaxzodbek16</a> 📞 Телефон: +998 91 526 01 12
ru: 🤖 Этот бот был создан <a href='https://t.me/tmshaxzodbek'>@tmshaxzodbek</a>. 🌐 Сайт: <a href='https://shaxzodbek.com'>Shaxzodbek</a> 💼 LinkedIn: <a href='https://linkedin.com/in/shaxzodbek-muxtorov-59144a294'>shaxzodbek</a> 📧 Email: <a href='mailto:muxtorovshaxzodbek16@gmail.com'>muxtorovshaxzodbek16@gmail.com</a> 📱 GitHub: <a href='https://github.com/Shaxzodbek16'>github.com/Shaxzodbek16</a> 📞 Телефон: +998 91 526 01 12
uz: 🤖 Ushbu bot <a href='https://t.me/tmshaxzodbek'>@tmshaxzodbek</a> tomonidan yaratilgan. 🌐 Sayt: <a href='https://shaxzodbek.com'>Shaxzodbek</a> 💼 LinkedIn: <a href='https://linkedin.com/in/shaxzodbek-muxtorov-59144a294'>shaxzodbek</a> 📧 Email: <a href='mailto:muxtorovshaxzodbek16@gmail.com'>muxtorovshaxzodbek16@gmail.com</a> 📱 GitHub: <a href='https://github.com/Shaxzodbek16'>github.com/Shaxzodbek16</a> 📞 Telefon: +998 91 526 01 12

source: likee_detected
kr: 📎 Likee ҳаволаси аниқланди! Қайта ишланмоқда...
ru: 📎 Likee ҳаволаси аниқланди! Қайта ишланмоқда...
uz: 📎 Likee havolasi aniqlandi! Qayta ishlanmoqda...

source: likee_video_ready
kr: 📽 Likee видеоси тайёр!
ru: 📽 Likee видеоси тайёр!
uz: 📽 Likee videosi tayyor!

source: likee_downloading_music
kr: 🎵 Likee'дан мусиқа юкланмоқда...
ru: 🎵 Likee'дан мусиқа юкланмоқда...
uz: 🎵 Likee'dan musiqa yuklanmoqda...

source: likee_music_not_implemented
kr: ❌ Мусиқа юклаш функцияси ҳали ишлаб чиқилмаган.
ru: ❌ Мусиқа юклаш функцияси ҳали ишлаб чиқилмаган.
uz: ❌ Musiqa yuklash funksiyasi hali ishlab chiqilmagan.

source: searching
kr: 🔍 Қидирилмоқда...
ru: 🔍 Поиск...
uz: 🔍 Qidirilmoqda...

source: analyzing_audio
kr: 🔍 Аудио таҳлил қилинмоқда...
ru: 🔍 Анализ аудио...
uz: 🔍 Audioni tahlil qilinyapti...

source: no_results
kr: 😕 Ҳеч қандай натижа топилмади.
ru: 😕 Результаты не найдены.
uz: 😕 Hech qanday natija topilmadi.

source: search_min_chars
kr: ⚠️ Қидириш учун камида 2 та белгидан фойдаланинг.
ru: ⚠️ Введите минимум 2 символа для поиска.
uz: ⚠️ Qidiruv uchun kamida 2 ta belgidan foydalaning.

source: please_retry
kr: ❌ Илтимос, ҳаволани қайтадан юборинг ёки кейинроқ уриниб кўринг.
ru: ❌ Пожалуйста, отправьте ссылку повторно или попробуйте позже.
uz: ❌ Iltimos, havolani qaytadan yuboring yoki keyinroq urinib ko‘ring.

source: tiktok_detected
kr: 📎 TikTok ҳаволаси топилди! Қайта ишланмоқда...
ru: 📎 Ссылка на TikTok обнаружена! Обработка...
uz: 📎 TikTok havolasi topildi! Qayta ishlanmoqda...

source: tiktok_video_ready
kr: 📽 Мана сизнинг TikTok видеонгиз!
ru: 📽 Вот ваше видео из TikTok!
uz: 📽 Mana sizning TikTok videongiz!

source: unknown_action
kr: ❌ Номаълум амал.
ru: ❌ Неизвестное действие.
uz: ❌ Noma'lum amal.

source: extracting
kr: 🔍 Мусиқа аниқланмоқда...
ru: 🔍 Извлечение и распознавание музыки...
uz: 🔍 Musiqa aniqlanmoqda...

source: session_expired
kr: ❌ Сессия тугаган. Илтимос, ҳаволани қайта юборинг.
ru: ❌ Сессия истекла. Пожалуйста, отправьте ссылку заново.
uz: ❌ Sessiya tugagan. Iltimos, havolani qayta yuboring.

source: extract_failed
kr: ❌ Аудиони ажратиб бўлмади.
ru: ❌ Не удалось извлечь аудио.
uz: ❌ Audio ajratib bo‘lmadi.

source: music_not_recognized
kr: 😕 Видеодан мусиқа аниқланмади.
ru: 😕 Не удалось распознать музыку в этом видео.
uz: 😕 Videodan musiqa aniqlanmadi.

source: music_found
kr: 🎶 <b>{title}</b> 👤 {artist}
ru: 🎶 <b>{title}</b> 👤 {artist}
uz: 🎶 <b>{title}</b> 👤 {artist}

source: recognition_error
kr: ❌ Мусиқа аниқлашда хатолик юз берди.
ru: ❌ Ошибка при распознавании
uz: ❌ Musiqa aniqlashda xatolik yuz berdi.

source: download_failed
kr: ❌ Видеони юклаб бўлмади
ru: ❌ Не удалось загрузить видео
uz: ❌ Videoni yuklab bo‘lmadi

source: refer_button
kr: 📥 Дўстларни таклиф қилинг ва мукофот олинг
ru: 📥 Пригласить друзей и заработать
uz: 📥 Do‘stlarni taklif qiling va mukofot oling

source: refer_bot_username_missing
kr: ❌ Хатолик: Бот фойдаланувчи номи йўқ. Админ билан боғланинг.
ru: ❌ Ошибка: имя пользователя бота не установлено. Свяжитесь с администратором.
uz: ❌ Xatolik: Bot foydalanuvchi nomi yo‘q. Admin bilan bog‘laning.

source: refer_message
kr: 🎁 <b>Таклиф қил ва ютуқ ол</b> 💸 <b>1 дўст = 1 соврин!</b> 🎯 Сиз таклиф қилганлар сони: <code>{count}</code> 🏆 Ҳар бир дўст учун сиз <b>{token_count}</b> токен — <b>1 ой БЕПУЛ</b> оласиз! 📲 <b>1-қадам:</b> Ҳаволангизни улашинг 👇 <code>{referral_link}</code> 🚀 <b>2-қадам:</b> Дўстингиз қўшилиши билан сиз токен ишлайсиз! ✨ <i>Келинг, биргаликда ўсайлик!</i>
ru: 🎁 <b>Пригласи и получай бонусы</b> 💸 <b>1 друг = 1 награда!</b> 🎯 Вы пригласили: <code>{count}</code> друзей(я) 🏆 За каждого друга вы получаете <b>{token_count}</b> токенов — это <b>1 месяц БЕСПЛАТНО</b>! 📲 <b>Шаг 1:</b> Поделитесь вашей ссылкой 👇 <code>{referral_link}</code> 🚀 <b>Шаг 2:</b> Подождите, пока ваш друг присоединится и начнет зарабатывать! ✨ <i>Давайте развиваться вместе!</i>
uz: 🎁 <b>Taklif qil va yutib ol</b> 💸 <b>1 do‘st = 1 sovrin!</b> 🎯 Siz taklif qilganlar soni: <code>{count}</code> 🏆 Har bir do‘st uchun sizga <b>{token_count}</b> token — <b>1 oy BEPUL</b> taqdim etiladi! 📲 <b>1-qadam:</b> Havolangizni ulashing 👇 <code>{referral_link}</code> 🚀 <b>2-qadam:</b> Do‘stingiz qo‘shilsin va token ishlang! ✨ <i>Keling, birga o‘saylik!</i>

source: refer_share_btn
kr: 📤 Дўстлар билан бўлишиш
ru: 📤 Поделиться с друзьями
uz: 📤 Do‘stlar bilan ulashish

source: refer_share_text
kr: Мeн билан токен ишлаш учун қўшилинг!
ru: Присоединяйся ко мне и получай токены!
uz: Menga qo‘shiling va tokenlarga ega bo‘ling!

source: snapchat_detected
kr: 📎 Snapchat ҳаволаси аниқланди! Қайта ишланмоқда...
ru: 📎 Ссылка на Snapchat обнаружена! Обработка...
uz: 📎 Snapchat havolasi aniqlandi! Qayta ishlanmoqda...

source: snapchat_download_failed
kr: ❌ Snapchat медиасини юклаб бўлмади.
ru: ❌ Не удалось загрузить медиа из Snapchat.
uz: ❌ Snapchat mediaini yuklab bo‘lmadi.

source: snapchat_video_ready
kr: 📽 Мана сизнинг Snapchat видеонгиз!
ru: 📽 Вот ваше видео из Snapchat!
uz: 📽 Mana sizning Snapchat videongiz!

source: snapchat_download_error
kr: ❌ Snapchat медиасини юклашда хатолик юз берди.
ru: ❌ Ошибка при загрузке медиа из Snapchat.
uz: ❌ Snapchat mediaini yuklab olishda xatolik yuz berdi.

source: your_referral_link
kr: 🔗 Сизнинг реферал ҳаволангиз: {link}
ru: 🔗 Ваша реферальная ссылка: {link}
uz: 🔗 Sizning referal havolangiz: {link}

source: pinterest_detected
kr: 📎 Pinterest ҳаволаси аниқланди! Қайта ишланмоқда...
ru: 📎 Ссылка на Pinterest обнаружена! Обработка...
uz: 📎 Pinterest havolasi aniqlandi! Qayta ishlanmoqda...

source: pinterest_download_failed
kr: ❌ Pinterest медиасини юклаб бўлмади.
ru: ❌ Не удалось загрузить медиа из Pinterest.
uz: ❌ Pinterest mediaini yuklab bo‘lmadi.

source: pinterest_video_ready
kr: 📽 Мана сизнинг Pinterest видеонгиз!
ru: 📽 Вот ваше видео из Pinterest!
uz: 📽 Mana sizning Pinterest videongiz!

source: pinterest_download_error
kr: ❌ Pinterest медиасини юклашда хатолик юз берди.
ru: ❌ Ошибка при загрузке Pinterest медиа.
uz: ❌ Pinterest mediaini yuklab olishda xatolik yuz berdi.

source: payment_info
kr: Балансингизни тўлдириш учун администратор билан боғланинг 💳 {username}
ru: Свяжитесь с админом, чтобы пополнить баланс 💳 {username}
uz: Balansingizni to‘ldirish uchun administrator bilan bog‘laning 💳 {username}

source: Please send the user's Telegram ID 👤
kr: Илтимос, фойдаланувчининг Telegram ID рақамини юборинг 👤
ru: Пожалуйста, отправьте Telegram ID пользователя 👤
uz: Iltimos, foydalanuvchining Telegram ID raqamini yuboring 👤

source: Invalid Telegram ID. Please send only numbers.
kr: Нотўғри Telegram ID. Фақат рақам юборинг.
ru: Недопустимый Telegram ID. Отправьте только цифры.
uz: Noto‘g‘ri Telegram ID. Faqat raqam yuboring.

source: How much do you want to add to the balance? 💵
kr: Балансга қанча қўшмоқчисиз? 💵
ru: Сколько вы хотите добавить на баланс? 💵
uz: Balansga qancha qo‘shmoqchisiz? 💵

source: Please send a valid positive number 💸
kr: Илтимос, тўғри мусбат сон юборинг 💸
ru: Пожалуйста, отправьте корректное положительное число 💸
uz: Iltimos, to‘g‘ri musbat son yuboring 💸

source: User not found ❌
kr: Фойдаланувчи топилмади ❌
ru: Пользователь не найден ❌
uz: Foydalanuvchi topilmadi ❌

source: Successfully added {amount} to user {tg_id} ✅
kr: {tg_id} фойдаланувчисига {amount} қўшилди ✅
ru: Успешно добавлено {amount} пользователю {tg_id} ✅
uz: {tg_id} foydalanuvchisiga {amount} qo‘shildi ✅

source: How much do you want to remove from the balance? 💵
kr: Балансдан қанча маблағ ечмоқчисиз? 💵
ru: Сколько вы хотите снять с баланса? 💵
uz: Balansdan qancha mablag‘ yechmoqchisiz? 💵

source: Insufficient balance to remove this amount ❌
kr: Бу миқдорни ечиш учун баланс етарли эмас ❌
ru: Недостаточно средств на балансе для снятия этой суммы ❌
uz: Bu miqdorni yechish uchun balans yetarli emas ❌

source: Remove from balance
kr: Балансдан ечиш
ru: Снять с баланса
uz: Balansdan yechish

source: You are not registered in the system ❌
kr: Сиз тизимга рўйхатдан ўтмагансиз ❌
ru: Вы не зарегистрированы в системе ❌
uz: Siz tizimga ro‘yxatdan o‘tmagansiz ❌

source: Your current balance is: {balance} 💰
kr: Жорий балансингиз: {balance} 💰
ru: Ваш текущий баланс: {balance} 💰
uz: Joriy balansingiz: {balance} 💰

source: Successfully removed {amount} from user {tg_id} ✅
kr: {tg_id} фойдаланувчисидан {amount} ечилди ✅
ru: Успешно снято {amount} с пользователя {tg_id} ✅
uz: {tg_id} foydalanuvchisidan {amount} yechildi ✅

source: payment_card_info
kr: Карта рақами: <code>9860350101441425</code> Эгаси: <code>Yo'ldoshev Adhamjon</code> {premium_price} сўмни ушбу картага ўтказинг ва тўлов скриншотини берилган usernamega юборинг.
ru: Номер карты: <code>9860350101441425</code> Владелец: <code>Yo'ldoshev Adhamjon</code> Переведите {premium_price} сум на эту карту и отправьте скриншот платежа на указанный логин.
uz: Karta raqami: <code>9860350101441425</code> Egasi: <code>Yo'ldoshev Adhamjon</code> {premium_price} so'mni ushbu kartaga o'tkazing va to'lov skrinshotini berilgan usernamega yuboring.

source: current_requests_info
kr: Сизнинг жорий сўровларингиз: {tokens} 💰
ru: Ваши текущие запросы: {tokens} 💰
uz: Sizning joriy so'rovlaringiz: {tokens} 💰

source: 💲 Fill Balance
kr: 💲 Балансни тўлдириш
ru: 💲 Пополнить баланс
uz: 💲 Balansni to'ldirish

source: Update Premium price
kr: Premium нархини янгилаш
ru: Обновить цену Premium
uz: Premium narxini yangilash

source: price_update_prompt
kr: ✍️ Илтимос, янги бутун сон қийматини юборинг (0 дан катта бўлиши керак), ёки бекор қилиш учун 🔙 ни босинг:
ru: ✍️ Пожалуйста, отправьте новое целое значение (должно быть > 0), или нажмите 🔙 для отмены:
uz: ✍️ Iltimos, yangi butun son qiymatini yuboring (0 dan katta bo'lishi kerak), yoki bekor qilish uchun 🔙 ni bosing:

source: 🔙 Back to Admin Panel
kr: 🔙 Админ панелга қайтиш
ru: 🔙 Назад к админ панели
uz: 🔙 Admin panelga qaytish

source: back_to_admin_panel
kr: 🔙 Админ панелга қайтилмоқда.
ru: 🔙 Возвращение к админ панели.
uz: 🔙 Admin panelga qaytilmoqda.

source: update_cancelled
kr: 🔙 Янгилаш бекор қилинди. Мана Админ панел:
ru: 🔙 Обновление отменено. Вот админ панель:
uz: 🔙 Yangilash bekor qilindi. Mana Admin panel:

source: invalid_price_input
kr: ⚠️ Нотўғри маълумот. Мусбат сон юборинг ёки 🔙 Админ панелга қайтиш тугмасини босинг.
ru: ⚠️ Неверный ввод. Отправьте положительное число или нажмите 🔙 Назад к админ панели.
uz: ⚠️ Noto'g'ri ma'lumot. Musbat son yuboring yoki 🔙 Admin panelga qaytish tugmasini bosing.

source: price_updated_success
kr: ✅ Реферал учун токенлар <b>{price}</b> га янгиланди.
ru: ✅ Токены за реферала обновлены до <b>{price}</b>.
uz: ✅ Referal uchun tokenlar <b>{price}</b> ga yangilandi.

source: subscription_confirmation
kr: {price} сўм эвазига обунани фаоллаштирмоқчимисиз?
ru: Хотите активировать подписку за {price} сум?
uz: {price} so'm evaziga obunani faollashtirmoqchimisiz?

source: subscription_activated
kr: ✅ Обуна фаоллаштирилди!
ru: ✅ Подписка активирована!
uz: ✅ Obuna faollashtirildi!

source: insufficient_balance
kr: ❌ Маблағ етарли эмас. Илтимос, балансни тўлдиринг.
ru: ❌ Недостаточно средств. Пожалуйста, пополните баланс.
uz: ❌ Mablag' yetarli emas. Iltimos, balansni to'ldiring.

source: payment_cancelled
kr: ❌ Тўлов бекор қилинди.
ru: ❌ Платеж отменен.
uz: ❌ To'lov bekor qilindi.

source: activate_subscription_btn
kr: Обунани фаоллаштириш
ru: Активировать подписку
uz: Obunani faollashtirish

source: invite_friends_btn
kr: Дўстларни таклиф қилиш
ru: Пригласить друзей
uz: Do'stlarni taklif qilish

source: confirm_btn
kr: ✅ Тасдиқлаш
ru: ✅ Подтвердить
uz: ✅ Tasdiqlash

source: cancel_btn
kr: ❌ Бекор қилиш
ru: ❌ Отмена
uz: ❌ Bekor qilish

source: view_link_btn
kr: 🔗 Ҳаволани кўриш
ru: 🔗 Посмотреть ссылку
uz: 🔗 Havolani ko'rish

source: update_btn
kr: ✏️ Янгилаш
ru: ✏️ Обновить
uz: ✏️ Yangilash

source: delete_btn
kr: 🗑️ Ўчириш
ru: 🗑️ Удалить
uz: 🗑️ O'chirish

source: yes_btn
kr: ✅ Ҳа
ru: ✅ Да
uz: ✅ Ha

source: no_btn
kr: ❌ Йўқ
ru: ❌ Нет
uz: ❌ Yo'q

source: check_subscription_btn
kr: ✅ Текшириш
ru: ✅ Проверить
uz: ✅ Tekshirish

source: download_music_btn
kr: Музикани юклаб олиш
ru: Скачать музыку
uz: Musikani yuklab olish

source: admin_panel_welcome
kr: 🛠 <b>Админ панел</b> 👋 Хуш келибсиз, админ! Бот ва фойдаланувчиларни самарали бошқариш учун қуйидаги менюдан амални танланг.
ru: 🛠 <b>Админ панель</b> 👋 Добро пожаловать, админ! Пожалуйста, выберите действие из меню ниже для эффективного управления ботом и пользователями.
uz: 🛠 <b>Admin panel</b> 👋 Xush kelibsiz, admin! Bot va foydalanuvchilarni samarali boshqarish uchun quyidagi menyudan amalni tanlang.

source: user_export_caption
kr: 📊 <b>Фойдаланувчилар экспорти</b> ✅ <b>Файл:</b> <code>{file_name}</code> 🕒 <b>Яратилган:</b> <code>{generated_time}</code>
ru: 📊 <b>Экспорт пользователей</b> ✅ <b>Файл:</b> <code>{file_name}</code> 🕒 <b>Создан:</b> <code>{generated_time}</code>
uz: 📊 <b>Foydalanuvchilar eksporti</b> ✅ <b>Fayl:</b> <code>{file_name}</code> 🕒 <b>Yaratilgan:</b> <code>{generated_time}</code>

source: export_failed_error
kr: ❌ Экспорт яратишда хатолик: <code>{error}</code>
ru: ❌ Не удалось создать экспорт: <code>{error}</code>
uz: ❌ Eksport yaratishda xatolik: <code>{error}</code>

source: user_growth_header
kr: 👥 <b>Фойдаланувчилар ўсиши ва реферал лидерлари</b>
ru: 👥 <b>Рост пользователей и лидеры рефералов</b>
uz: 👥 <b>Foydalanuvchilar o'sishi va referal liderlari</b>

source: stats_today
kr: 📅 Бугун: <b>{count}</b> янги
ru: 📅 Сегодня: <b>{count}</b> новых
uz: 📅 Bugun: <b>{count}</b> yangi

source: stats_yesterday
kr: 📅 Кеча: <b>{count}</b>
ru: 📅 Вчера: <b>{count}</b>
uz: 📅 Kecha: <b>{count}</b>

source: stats_last_week
kr: 📅 Сўнгги 7 кун: <b>{count}</b>
ru: 📅 За последние 7 дней: <b>{count}</b>
uz: 📅 So'nggi 7 kun: <b>{count}</b>

source: stats_last_month
kr: 📅 Сўнгги ой: <b>{count}</b>
ru: 📅 За последний месяц: <b>{count}</b>
uz: 📅 So'nggi oy: <b>{count}</b>

source: stats_last_year
kr: 📅 Сўнгги йил: <b>{count}</b>
ru: 📅 За последний год: <b>{count}</b>
uz: 📅 So'nggi yil: <b>{count}</b>

source: stats_all_time
kr: 📅 Барча вақт: <b>{count}</b>
ru: 📅 За все время: <b>{count}</b>
uz: 📅 Barcha vaqt: <b>{count}</b>

source: top_referrers_header
kr: 🔥 <b>Топ 10 рефералчилар</b>:
ru: 🔥 <b>Топ 10 рефереров</b>:
uz: 🔥 <b>Top 10 referalchilar</b>:

source: referrer_item
kr: {idx}. {name} (<code>{tg_id}</code>) — {count} реферал
ru: {idx}. {name} (<code>{tg_id}</code>) — {count} рефералов
uz: {idx}. {name} (<code>{tg_id}</code>) — {count} referal

source: connected_channels_header
kr: 📡 <b>Уланган Telegram каналлари</b>:
ru: 📡 <b>Подключенные Telegram каналы</b>:
uz: 📡 <b>Ulangan Telegram kanallari</b>:

source: channel_active
kr: 🟢 Фаол
ru: 🟢 Активен
uz: 🟢 Faol

source: channel_inactive
kr: 🔴 Нофаол
ru: 🔴 Неактивен
uz: 🔴 Nofaol

source: channel_item
kr: {idx}. <a href='{link}'>{name}</a> — {status}
ru: {idx}. <a href='{link}'>{name}</a> — {status}
uz: {idx}. <a href='{link}'>{name}</a> — {status}

source: no_channels_connected
kr: Каналлар уланмаган.
ru: Каналы не подключены.
uz: Kanallar ulanmagan.

source: usage_statistics_header
kr: 📊 <b>Фойдаланиш статистикаси</b>:
ru: 📊 <b>Статистика использования</b>:
uz: 📊 <b>Foydalanish statistikasi</b>:

source: usage_from_text
kr: • Матндан фойдаланишлар сони: <b>{count}</b>
ru: • Использований текста: <b>{count}</b>
uz: • Matndan foydalanishlar soni: <b>{count}</b>

source: usage_from_voice
kr: • Овоздан фойдаланишлар сони: <b>{count}</b>
ru: • Использований голоса: <b>{count}</b>
uz: • Ovozdan foydalanishlar soni: <b>{count}</b>

source: usage_from_youtube
kr: • YouTube'дан фойдаланишлар сони: <b>{count}</b>
ru: • Использований YouTube: <b>{count}</b>
uz: • YouTube'dan foydalanishlar soni: <b>{count}</b>

source: usage_from_tiktok
kr: • TikTok'дан фойдаланишлар сони: <b>{count}</b>
ru: • Использований TikTok: <b>{count}</b>
uz: • TikTok'dan foydalanishlar soni: <b>{count}</b>

source: usage_from_like
kr: • Likee'дан фойдаланишлар сони: <b>{count}</b>
ru: • Использований Likee: <b>{count}</b>
uz: • Likee'dan foydalanishlar soni: <b>{count}</b>

source: usage_from_snapchat
kr: • Snapchat'дан фойдаланишлар сони: <b>{count}</b>
ru: • Использований Snapchat: <b>{count}</b>
uz: • Snapchat'dan foydalanishlar soni: <b>{count}</b>

source: usage_from_instagram
kr: • Instagram'дан фойдаланишлар сони: <b>{count}</b>
ru: • Использований Instagram: <b>{count}</b>
uz: • Instagram'dan foydalanishlar soni: <b>{count}</b>

source: usage_from_twitter
kr: • Twitter'дан фойдаланишлар сони: <b>{count}</b>
ru: • Использований Twitter: <b>{count}</b>
uz: • Twitter'dan foydalanishlar soni: <b>{count}</b>

source: current_token_and_price
kr: Жорий токен сони: <b>{tokens}</b> Жорий премиум нархи: <b>{price}</b> токен
ru: Текущее количество токенов: <b>{tokens}</b> Текущая цена премиум: <b>{price}</b> токенов
uz: Joriy token soni: <b>{tokens}</b> Joriy premium narxi: <b>{price}</b> token

source: settings_page
kr: 🔧 <b>Созламалар</b> Бу ерда сиз бот созламаларини ўзгартиришингиз мумкин, жумладан билдиришнома созламалари, тил танловлари ва бошқалар.
ru: 🔧 <b>Настройки</b> Здесь вы можете настроить параметры бота, включая настройки уведомлений, языковые опции и многое другое.
uz: 🔧 <b>Sozlamalar</b> Bu yerda siz bot sozlamalarini o'zgartirishingiz mumkin, jumladan bildirishnoma sozlamalari, til tanlovlari va boshqalar.

source: channels_page
kr: 📈 <b>Каналлар</b> Бу ерда сиз бот билан боғланган каналларни бошқаришингиз мумкин, жумладан каналлар қўшиш, таҳрирлаш ва ўчириш.
ru: 📈 <b>Каналы</b> Здесь вы можете управлять каналами, связанными с ботом, включая добавление, редактирование и удаление каналов.
uz: 📈 <b>Kanallar</b> Bu yerda siz bot bilan bog'langan kanallarni boshqarishingiz mumkin, jumladan kanallar qo'shish, tahrirlash va o'chirish.

source: broadcast_cancelled
kr: 🔙 Оммавий хабар бекор қилинди.
ru: 🔙 Рассылка отменена.
uz: 🔙 Ommaviy xabar bekor qilindi.

source: back_to_admin_panel_welcome
kr: 🔙 <b>Админ панел</b> Хуш келибсиз! Бажармоқчи бўлган амални танланг:
ru: 🔙 <b>Админ панель</b> Добро пожаловать обратно! Пожалуйста, выберите действие, которое хотите выполнить:
uz: 🔙 <b>Admin panel</b> Xush kelibsiz! Bajarmoqchi bo'lgan amalni tanlang:

source: settings_overview
kr: ⚙️ <b>Созламалар</b> 🔢 Жорий реферал учун токенлар: <b>{current_tokens}</b> Жорий премиум нархи {premium_price}: <b>100</b> токен
ru: ⚙️ <b>Настройки</b> 🔢 Текущие токены за реферала: <b>{current_tokens}</b> Текущая цена премиум {premium_price}: <b>100</b> токенов
uz: ⚙️ <b>Sozlamalar</b> 🔢 Joriy referal uchun tokenlar: <b>{current_tokens}</b> Joriy premium narxi {premium_price}: <b>100</b> token

source: ask_new_token_value
kr: ✍️ Илтимос, янги бутун сон қийматини юборинг (0 дан катта бўлиши керак), ёки бекор қилиш учун 🔙 ни босинг:
ru: ✍️ Пожалуйста, отправьте новое целое значение (должно быть > 0), или нажмите 🔙 для отмены:
uz: ✍️ Iltimos, yangi butun son qiymatini yuboring (0 dan katta bo'lishi kerak), yoki bekor qilish uchun 🔙 ni bosing:

source: returning_to_admin_panel
kr: 🔙 Админ панелга қайтилмоқда.
ru: 🔙 Возвращение к админ панели.
uz: 🔙 Admin panelga qaytilmoqda.

source: token_update_cancelled
kr: 🔙 Янгилаш бекор қилинди. Мана Админ панел:
ru: 🔙 Обновление отменено. Вот админ панель:
uz: 🔙 Yangilash bekor qilindi. Mana Admin panel:

source: invalid_token_input
kr: ⚠️ Нотўғри маълумот. Мусбат сон юборинг ёки 🔙 Админ панелга қайтиш тугмасини босинг.
ru: ⚠️ Неверный ввод. Отправьте положительное число или нажмите 🔙 Назад к админ панели.
uz: ⚠️ Noto'g'ri ma'lumot. Musbat son yuboring yoki 🔙 Admin panelga qaytish tugmasini bosing.

source: token_updated_success
kr: ✅ Реферал учун токенлар <b>{tokens}</b> га янгиланди.
ru: ✅ Токены за реферала обновлены до <b>{tokens}</b>.
uz: ✅ Referal uchun tokenlar <b>{tokens}</b> ga yangilandi.

source: broadcast_start_message
kr: 📢 <b>Барча фойдаланувчиларга хабар</b> Менга хабар матнини <i>HTML</i> форматида юборинг:
ru: 📢 <b>Рассылка всем пользователям</b> Отправьте мне текст сообщения в <i>HTML</i> формате:
uz: 📢 <b>Barcha foydalanuvchilarga xabar</b> Menga xabar matnini <i>HTML</i> formatida yuboring:
