Repository: Shaxzodbek16/TinglaBot
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: kr, ru, uz

source: broadcast_html_instructions
kr: 📢 <b>Барча фойдаланувчиларга хабар</b> Хабарингизни ушбу HTML теглар ёрдамида юборинг: <b>қалин</b> — <code>&lt;b&gt;қалин&lt;/b&gt;</code> <i>қийшиқ</i> — <code>&lt;i&gt;қийшиқ&lt;/i&gt;</code> <u>чизилган</u> — <code>&lt;u&gt;чизилган&lt;/u&gt;</code> <a href="URL">ҳавола</a> — <code>&lt;a href="URL"&gt;ҳавола&lt;/a&gt;</code> <code>код</code> — <code>&lt;code&gt;…&lt;/code&gt;</code> <pre>форматланган</pre> — <code>&lt;pre&gt;…&lt;/pre&gt;</code> Кейин Юбориш тугмасини босинг. Мен буни HTML сифатида қайта ишлайман ва ҳаммага юбораман.
ru: 📢 <b>Рассылка всем пользователям</b> Отправьте мне ваше сообщение, используя эти HTML теги: <b>жирный</b> — <code>&lt;b&gt;жирный&lt;/b&gt;</code> <i>курсив</i> — <code>&lt;i&gt;курсив&lt;/i&gt;</code> <u>подчеркнутый</u> — <code>&lt;u&gt;подчеркнутый&lt;/u&gt;</code> <a href="URL">ссылка</a> — <code>&lt;a href="URL"&gt;ссылка&lt;/a&gt;</code> <code>код</code> — <code>&lt;code&gt;…&lt;/code&gt;</code> <pre>предформатированный</pre> — <code>&lt;pre&gt;…&lt;/pre&gt;</code> Затем нажмите Отправить. Я обработаю это как HTML и отправлю всем.
uz: 📢 <b>Barcha foydalanuvchilarga xabar</b> Xabaringizni ushbu HTML teglar yordamida yuboring: <b>qalin</b> — <code>&lt;b&gt;qalin&lt;/b&gt;</code> <i>qiyshiq</i> — <code>&lt;i&gt;qiyshiq&lt;/i&gt;</code> <u>chizilgan</u> — <code>&lt;u&gt;chizilgan&lt;/u&gt;</code> <a href="URL">havola</a> — <code>&lt;a href="URL"&gt;havola&lt;/a&gt;</code> <code>kod</code> — <code>&lt;code&gt;…&lt;/code&gt;</code> <pre>formatlangan</pre> — <code>&lt;pre&gt;…&lt;/pre&gt;</code> Keyin Yuborish tugmasini bosing. Men buni HTML sifatida qayta ishlayman va hammaga yuboraman.

source: ask_for_media
kr: 🎞 Фото, видео ёки ҳужжат қўшишни хоҳлайсизми?
ru: 🎞 Хотите ли вы включить фото, видео или документ?
uz: 🎞 Foto, video yoki hujjat qo'shishni xohlaysizmi?

source: broadcast_started
kr: ✅ Хабар юбориш фонда бошланди. Тугагач сизга хабар бераман.
ru: ✅ Рассылка запущена в фоне. Я уведомлю вас, когда она завершится.
uz: ✅ Xabar yuborish fonda boshlandi. Tugagach sizga xabar beraman.

source: broadcast_with_media_started
kr: ✅ Медиа билан хабар юбориш фонда бошланди.
ru: ✅ Рассылка с медиа запущена в фоне.
uz: ✅ Media bilan xabar yuborish fonda boshlandi.

source: 📋 <b>Channel List</b>
kr: 📋 <b>Каналлар рўйхати</b>
ru: 📋 <b>Список каналов</b>
uz: 📋 <b>Kanallar ro'yxati</b>

source: Here you can view the list of channels that have been added.
kr: Бу ерда қўшилган каналлар рўйхатини кўришингиз мумкин.
ru: Здесь вы можете просмотреть список добавленных каналов.
uz: Bu yerda qo'shilgan kanallar ro'yxatini ko'rishingiz mumkin.

source: Use the buttons below to manage your channels.
kr: Каналларингизни бошқариш учун қуйидаги тугмалардан фойдаланинг.
ru: Используйте кнопки ниже для управления каналами.
uz: Kanallaringizni boshqarish uchun quyidagi tugmalardan foydalaning.

source: 🗑️ Channel %(channel_id)d deleted.
kr: 🗑️ %(channel_id)d канал ўчирилди.
ru: 🗑️ Канал %(channel_id)d удален.
uz: 🗑️ %(channel_id)d kanal o'chirildi.

source: ❌ Channel not found.
kr: ❌ Канал топилмади.
ru: ❌ Канал не найден.
uz: ❌ Kanal topilmadi.

source: Active
kr: Фаол
ru: Активный
uz: Faol

source: Inactive
kr: Нофаол
ru: Неактивный
uz: Nofaol

source: 📺 <b>Channel Info</b>
kr: 📺 <b>Канал маълумотлари</b>
ru: 📺 <b>Информация о канале</b>
uz: 📺 <b>Kanal ma'lumotlari</b>

source: <b>Name:</b> %(name)s
kr: <b>Номи:</b> %(name)s
ru: <b>Название:</b> %(name)s
uz: <b>Nomi:</b> %(name)s

source: <b>Link:</b> %(link)s
kr: <b>Ҳавола:</b> %(link)s
ru: <b>Ссылка:</b> %(link)s
uz: <b>Havola:</b> %(link)s

source: <b>Status:</b> %(status)s
kr: <b>Ҳолати:</b> %(status)s
ru: <b>Статус:</b> %(status)s
uz: <b>Holati:</b> %(status)s

source: 📣 Please send the <b>channel name</b>:
kr: 📣 Илтимос, <b>канал номини</b> юборинг:
ru: 📣 Пожалуйста, отправьте <b>название канала</b>:
uz: 📣 Iltimos, <b>kanal nomini</b> yuboring:

source: 🔗 Now send the <b>channel link</b> (e.g. https://t.me/yourchannel):
kr: 🔗 Энди <b>канал ҳаволасини</b> юборинг (масалан: https://t.me/yourchannel):
ru: 🔗 Теперь отправьте <b>ссылку на канал</b> (например: https://t.me/yourchannel):
uz: 🔗 Endi <b>kanal havolasini</b> yuboring (masalan: https://t.me/yourchannel):

source: 🆔 Please send the <b>numeric channel ID</b> (only digits):
kr: 🆔 Илтимос, <b>канал рақамли ID сини</b> юборинг (фақат рақамлар):
ru: 🆔 Пожалуйста, отправьте <b>числовой ID канала</b> (только цифры):
uz: 🆔 Iltimos, <b>kanal raqamli ID sini</b> yuboring (faqat raqamlar):

source: ✅ Should this channel be active?
kr: ✅ Бу канал фаол бўлиши керакми?
ru: ✅ Должен ли этот канал быть активным?
uz: ✅ Bu kanal faol bo'lishi kerakmi?

source: ❗️ Please send a valid numeric channel ID (example: <code>-1001234567890</code>).
kr: ❗️ Илтимос, тўғри рақамли канал ID сини юборинг (масалан: <code>-1001234567890</code>).
ru: ❗️ Пожалуйста, отправьте правильный числовой ID канала (пример: <code>-1001234567890</code>).
uz: ❗️ Iltimos, to'g'ri raqamli kanal ID sini yuboring (masalan: <code>-1001234567890</code>).

source: ❓ Please tap ✅ Yes or ❌ No.
kr: ❓ Илтимос, ✅ Ҳа ёки ❌ Йўқ тугмасини босинг.
ru: ❓ Пожалуйста, нажмите ✅ Да или ❌ Нет.
uz: ❓ Iltimos, ✅ Ha yoki ❌ Yo'q tugmasini bosing.

source: ⚠️ That link is already in use. Please start over with a unique channel link.
kr: ⚠️ Бу ҳавола аллақачон ишлатилмоқда. Илтимос, ноёб канал ҳаволаси билан қайтадан бошланг.
ru: ⚠️ Эта ссылка уже используется. Пожалуйста, начните заново с уникальной ссылкой на канал.
uz: ⚠️ Bu havola allaqachon ishlatilmoqda. Iltimos, noyob kanal havolasi bilan qaytadan boshlang.

source: ⚠️ That channel ID is already in use. Please start over with a unique ID.
kr: ⚠️ Бу канал ID си аллақачон ишлатилмоқда. Илтимос, ноёб ID билан қайтадан бошланг.
ru: ⚠️ Этот ID канала уже используется. Пожалуйста, начните заново с уникальным ID.
uz: ⚠️ Bu kanal ID si allaqachon ishlatilmoqda. Iltimos, noyob ID bilan qaytadan boshlang.

source: ❌ Database error: <code>%(error)s</code>
kr: ❌ Маълумотлар базаси хатоси: <code>%(error)s</code>
ru: ❌ Ошибка базы данных: <code>%(error)s</code>
uz: ❌ Ma'lumotlar bazasi xatosi: <code>%(error)s</code>

source: 🎉 Channel <b>%(name)s</b> has been added successfully! Make sure to set the channel's privacy settings to allow the bot to access it.
kr: 🎉 <b>%(name)s</b> канал муваффақиятли қўшилди! Ботнинг каналга кириш имкониятига эга бўлиши учун канал махфийлик созламаларини ўрнатганингизга ишонч ҳосил қилинг.
ru: 🎉 Канал <b>%(name)s</b> успешно добавлен! Убедитесь, что настройки приватности канала позволяют боту получить к нему доступ.
uz: 🎉 <b>%(name)s</b> kanal muvaffaqiyatli qo'shildi! Botning kanalga kirish imkoniga ega bo'lishi uchun kanal maxfiylik sozlamalarini o'rnatganingizga ishonch hosil qiling.

source: ✏️ <b>Update Channel Name</b> Send the new name or tap ⏭ Skip to keep the old one:
kr: ✏️ <b>Канал номини янгилаш</b> Янги номни юборинг ёки эскисини сақлаш учун ⏭ Ўтказиб юбориш тугмасини босинг:
ru: ✏️ <b>Обновить название канала</b> Отправьте новое название или нажмите ⏭ Пропустить, чтобы оставить старое:
uz: ✏️ <b>Kanal nomini yangilash</b> Yangi nomni yuboring yoki eskisini saqlash uchun ⏭ O'tkazib yuborish tugmasini bosing:

source: 🔗 <b>Update Channel Link</b> Send the new link or tap ⏭ Skip to keep the old one:
kr: 🔗 <b>Канал ҳаволасини янгилаш</b> Янги ҳаволани юборинг ёки эскисини сақлаш учун ⏭ Ўтказиб юбориш тугмасини босинг:
ru: 🔗 <b>Обновить ссылку канала</b> Отправьте новую ссылку или нажмите ⏭ Пропустить, чтобы оставить старую:
uz: 🔗 <b>Kanal havolasini yangilash</b> Yangi havolani yuboring yoki eskisini saqlash uchun ⏭ O'tkazib yuborish tugmasini bosing:

source: ⚠️ That link exists. Send a unique link or tap ⏭ Skip:
kr: ⚠️ Бу ҳавола мавжуд. Ноёб ҳаволани юборинг ёки ⏭ Ўтказиб юбориш тугмасини босинг:
ru: ⚠️ Эта ссылка существует. Отправьте уникальную ссылку или нажмите ⏭ Пропустить:
uz: ⚠️ Bu havola mavjud. Noyob havolani yuboring yoki ⏭ O'tkazib yuborish tugmasini bosing:

source: ❌ DB error: <code>%(error)s</code>
kr: ❌ МБ хатоси: <code>%(error)s</code>
ru: ❌ Ошибка БД: <code>%(error)s</code>
uz: ❌ MB xatosi: <code>%(error)s</code>

source: ✅ Channel <b>%(name)s</b> updated! 🔗 Link: <code>%(link)s</code>
kr: ✅ <b>%(name)s</b> канал янгиланди! 🔗 Ҳавола: <code>%(link)s</code>
ru: ✅ Канал <b>%(name)s</b> обновлен! 🔗 Ссылка: <code>%(link)s</code>
uz: ✅ <b>%(name)s</b> kanal yangilandi! 🔗 Havola: <code>%(link)s</code>

source: 🚫 You still need to join these channels.
kr: 🚫 Сиз ҳали ҳам бу каналларга обуна бўлишингиз керак.
ru: 🚫 Вам все еще нужно подписаться на эти каналы.
uz: 🚫 Siz hali ham bu kanallarga obuna bo'lishingiz kerak.

source: You have no any requests left. 😢
kr: Сизда сўровлар қолмади. 😢
ru: У вас не осталось запросов. 😢
uz: Sizda so'rovlar qolmadi. 😢

source: 📁 Users excel
ru: 📁 Пользователи (Excel)

source: 📊 Statistics
ru: 📊 Статистика

source: 🔧 Settings
ru: 🔧 Настройки

source: 📈 Channels
ru: 📈 Каналы

source: 🔙 Back to Main Menu
ru: 🔙 На главную

source: Choose an admin action 🔧
ru: Выберите действие 🔧

source: ➕ Add Channel
ru: ➕ Добавить канал

source: 📋 View Channels
ru: 📋 Список каналов

source: Select channel action 📡
ru: Выберите действие с каналом 📡

source: Update Tokens per Referral
ru: Обновить токены за реферала

source: Send Message to All Users
ru: Отправить сообщение всем

source: Settings options ⚙️
ru: Настройки ⚙️

source: ✅ Add Media
ru: ✅ Добавить медиа

source: ⏭ Skip Media
ru: ⏭ Пропустить медиа

source: threads_invalid_url
uz: ❌ Noto'g'ri Threads URL! Iltimos, to'g'ri post linkini yuboring. Masalan: https://threads.net/@username/post/abc123

source: threads_loading
uz: 🔄 Threads posti tahlil qilinmoqda...

source: threads_sending_files
uz: ✅ {count} ta fayl yuklandi! 📤 Yuborilmoqda...

source: threads_success
uz: 🎉 Threads posti muvaffaqiyatli yuklandi! 📁 Jami: {total} ta fayl{failed_info}

source: threads_failed
uz: ❌ Yuborish uchun fayl topilmadi.

source: threads_error
uz: ❌ Threads linkni qayta ishlashda xatolik yuz berdi. Iltimos, yana urinib ko‘ring.

source: threads_video_too_large
uz: ⚠️ Video fayl hajmi juda katta: {name} 📁 Fayl: {path} 📏 Hajm: {size} MB

source: threads_video_send_error
uz: ❌ Videolarni yuborishda xatolik yuz berdi.

source: shorts_loading
uz: 🔄 YouTube Shorts yuklab olinmoqda...

source: shorts_video_ready
uz: ✅ YouTube Shorts tayyor!

source: shorts_no_files
uz: ❌ Video topilmadi

source: shorts_error
uz: ❌ Yuklab olishda xatolik yuz berdi
